<a href="https://colab.research.google.com/github/Ckiteme/Ckiteme_Assisgnment_Data_Analysis_with__SQL/blob/main/Ckiteme_Assisgnment_Data_Analysis_with__SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Instructions**


Over the past few years, ride-sharing apps have been on the rise across many cities in the world. 
While this has happened, Uber and Lyft's ride prices are not constant like
public transport. They are greatly affected by the demand and supply of rides at a given time.
As a Data Scientist working to understand this market, you have been tasked to come up with a descriptive analysis report to help a Ride-Sharing Startup coming into this space, understand the various patterns on how pricing works for the existing ride-sharing company.
Luckily, you were able to access some real-time data from Uber & Lyft's API and weather data from Weather API conditions.
You build a custom application in Scala to query data at regular intervals and saved it to DynamoDB. The queried cab ride estimates are done after every 5 mins and weather data after every 1 hr.
The cab ride data covers various types of cabs for Uber & Lyft and their price for the given location. Weather data contains weather attributes like temperature, rain, cloud,  etc for all the locations taken into consideration.

**Pre-requisites**

In [ ]:
# We will first load an sql extension. 
# Notebook extensions are simple add-ons that extend the basic 
# functionality of the notebook environment. 
# This extension will allow us to run SQL code in our Notebook.
# ---
#
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [ ]:
# We will then connect to an in memory SQLite database within colaboratory. 
# Something to note is that this in memory dataset will be deleted as 
# soon the dataset connection is lost, meaning when our connection to 
# the servers is disconnected then our database will cease to exist.
# ---
#  
%sql sqlite://

'Connected: @None'

In [ ]:
# We will now need the pandas library to read our csv file 
# from an external the source. 
# ---
#
import pandas as pd

In [ ]:
cab_rides = pd.read_csv("cab_rides.csv", encoding="ISO-8859-1")

**Importing** **Data**

In [ ]:
# We load our first dataset from a csv file as shown then  
# after store the dataset in our in memory sqlite database.
# We read our dataset from its source and store it in a dataframe 
# called cab_rides 
# ---
#
cab_rides = pd.read_csv('/content/cab_rides.csv') 

# Then store it in an SQL table of our in memory sqlite database 
# --- 
# 

# We then delete the table if it exists in our database
# ---
#
%sql DROP TABLE IF EXISTS cab_rides;

# And finally store our table in the table name cab_rides within our dataset.
# The persist command will create a table in the database to which we are connected, 
# the table name will be the same as dataframe variable.
# ---
#
%sql PERSIST cab_rides;

# Preview the first 5 records of the cab_rides dataset 
# ---
#
%sql SELECT * FROM cab_rides LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, 0.44, 'Lyft', 1544952607890, 'North Station', 'Haymarket Square', 5.0, 1.0, '424553bb-7174-41ea-aeb4-fe06d4f4b9d7', 'lyft_line', 'Shared'),
 (1, 0.44, 'Lyft', 1544952607890, 'North Station', 'Haymarket Square', 11.0, 1.0, '4bd23055-6827-41c6-b23b-3c491f24e74d', 'lyft_premier', 'Lux'),
 (2, 0.44, 'Lyft', 1544952607890, 'North Station', 'Haymarket Square', 7.0, 1.0, '981a3613-77af-4620-a42a-0c0866077d1e', 'lyft', 'Lyft'),
 (3, 0.44, 'Lyft', 1544952607890, 'North Station', 'Haymarket Square', 26.0, 1.0, 'c2d88af2-d278-4bfd-a8d0-29ca77cc5512', 'lyft_luxsuv', 'Lux Black XL'),
 (4, 0.44, 'Lyft', 1544952607890, 'North Station', 'Haymarket Square', 9.0, 1.0, 'e0126e1f-8ca9-4f2e-82b3-50505a09db9a', 'lyft_plus', 'Lyft XL')]

In [ ]:
weather = pd.read_csv("/content/weather.csv", encoding="ISO-8859-1")

In [ ]:
# We load our first dataset from a csv file as shown then  
# after store the dataset in our in memory sqlite database.
# We read our dataset from its source and store it in a dataframe 
# called weather
# ---
#
weather = pd.read_csv('/content/weather.csv') 

# Then store it in an SQL table of our in memory sqlite database 
# --- 
# 

# We then delete the table if it exists in our database
# ---
#
%sql DROP TABLE IF EXISTS weather;

# And finally store our table in the table name weather within our dataset.
# The persist command will create a table in the database to which we are connected, 
# the table name will be the same as dataframe variable.
# ---
#
%sql PERSIST weather;

# Preview the first 5 records of the weather dataset 
# ---
#
%sql SELECT * FROM weather LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, 42.42, 'Back Bay', 1.0, 1012.14, 0.1228, 1545003901, 0.77, 11.25),
 (1, 42.43, 'Beacon Hill', 1.0, 1012.15, 0.1846, 1545003901, 0.76, 11.32),
 (2, 42.5, 'Boston University', 1.0, 1012.15, 0.1089, 1545003901, 0.76, 11.07),
 (3, 42.11, 'Fenway', 1.0, 1012.13, 0.0969, 1545003901, 0.77, 11.09),
 (4, 43.13, 'Financial District', 1.0, 1012.14, 0.1786, 1545003901, 0.75, 11.49)]

In [ ]:
#Filtering, Sorting, and Grouping
#Perform filtering, sorting, and grouping to explore a dataset using the SQL language

%%sql
SELECT SUM(price) AS 'Total Sales from Haymarket Square'
FROM cab_rides
WHERE source = 'Haymarket Square';

 * sqlite://
Done.

[(721636.0,)]

In [ ]:
# Getting the average weather pattern for locations, from the highest.
# ---

%%sql 
SELECT location, AVG(rain) FROM weather
GROUP BY location
ORDER BY AVG(rain) DESC
LIMIT 10;

 * sqlite://
Done.

[('Financial District', 0.06135205479452055),
 ('Theatre District', 0.06021369863013696),
 ('Haymarket Square', 0.05959342105263155),
 ('South Station', 0.05953698630136987),
 ('West End', 0.05880259740259739),
 ('North End', 0.058711688311688284),
 ('Beacon Hill', 0.057097368421052626),
 ('North Station', 0.056542499999999975),
 ('Back Bay', 0.05601216216216215),
 ('Fenway', 0.05486285714285716)]

In [ ]:
%%sql 
SELECT location, AVG(temp) FROM weather
GROUP BY location
ORDER BY AVG(temp) DESC
LIMIT 10;

 * sqlite://
Done.

[('Financial District', 39.41082217973236),
 ('South Station', 39.39409177820272),
 ('North End', 39.09084130019119),
 ('Back Bay', 39.082122370936894),
 ('Haymarket Square', 39.067896749521985),
 ('Boston University', 39.04774378585083),
 ('Beacon Hill', 39.04728489483753),
 ('North Station', 39.03531548757167),
 ('Theatre District', 38.98671128107077),
 ('West End', 38.9834034416826)]

In [ ]:
%%sql 
SELECT location, AVG(wind) FROM weather
GROUP BY location
ORDER BY AVG(wind) DESC
LIMIT 10;

 * sqlite://
Done.

[('Financial District', 6.860019120458891),
 ('North End', 6.8531166347992345),
 ('South Station', 6.848948374760993),
 ('Haymarket Square', 6.843193116634804),
 ('North Station', 6.835755258126191),
 ('Theatre District', 6.834302103250482),
 ('West End', 6.816233269598474),
 ('Beacon Hill', 6.8103250478011494),
 ('Back Bay', 6.778527724665383),
 ('Northeastern University', 6.749426386233272)]

In [ ]:
#Data Formatting
#Perform data formatting of numeric data to prepare data for further analysis using the SQL language.

%%sql 
SELECT UPPER(location) AS LOCATION, rain AS RAIN
FROM weather 
LIMIT 5;

 * sqlite://
Done.

[('BACK BAY', 0.1228),
 ('BEACON HILL', 0.1846),
 ('BOSTON UNIVERSITY', 0.1089),
 ('FENWAY', 0.0969),
 ('FINANCIAL DISTRICT', 0.1786)]

In [ ]:

%%sql 
SELECT location AS LOCATION, ROUND(wind, 1) AS wind 
FROM weather LIMIT 5;

 * sqlite://
Done.

[('Back Bay', 11.3),
 ('Beacon Hill', 11.3),
 ('Boston University', 11.1),
 ('Fenway', 11.1),
 ('Financial District', 11.5)]

In [ ]:
%%sql 
SELECT UPPER(destination) AS DESTINATION, source AS SOURCE
FROM cab_rides 
LIMIT 5;

 * sqlite://
Done.

[('NORTH STATION', 'Haymarket Square'),
 ('NORTH STATION', 'Haymarket Square'),
 ('NORTH STATION', 'Haymarket Square'),
 ('NORTH STATION', 'Haymarket Square'),
 ('NORTH STATION', 'Haymarket Square')]

In [ ]:
%%sql 
SELECT source AS SOURCE, ROUND(distance, 1) AS distance 
FROM cab_rides LIMIT 5;

 * sqlite://
Done.

[('Haymarket Square', 0.4),
 ('Haymarket Square', 0.4),
 ('Haymarket Square', 0.4),
 ('Haymarket Square', 0.4),
 ('Haymarket Square', 0.4)]

In [ ]:
#Basic Statistical Techniques
#Perform basic statistical techniques using COUNT, MIN, MAX, and SUM functions using the SQL language.

%%sql 
SELECT cab_type, AVG(price), AVG(distance) FROM cab_rides
WHERE destination = 'West End'
GROUP BY cab_type 
ORDER BY AVG(price) DESC
LIMIT 5;

 * sqlite://
Done.

[('Lyft', 17.075600141209694, 2.116599199811786),
 ('Uber', 15.438013673721725, 2.115906611390391)]

In [ ]:
%%sql 
SELECT cab_type, destination, Count(cab_type) FROM cab_rides
GROUP BY destination
ORDER BY Count(cab_type) DESC
LIMIT 10;

 * sqlite://
Done.

[('Uber', 'Financial District', 58851),
 ('Lyft', 'Theatre District', 57798),
 ('Lyft', 'Back Bay', 57780),
 ('Lyft', 'Boston University', 57764),
 ('Uber', 'Haymarket Square', 57764),
 ('Lyft', 'Fenway', 57757),
 ('Uber', 'North End', 57756),
 ('Uber', 'Northeastern University', 57755),
 ('Uber', 'South Station', 57749),
 ('Uber', 'West End', 57575)]

In [ ]:
%%sql 
SELECT cab_type, source, SUM(distance) FROM cab_rides
GROUP BY source
ORDER BY SUM(distance) DESC
LIMIT 10;

 * sqlite://
Done.

[('Uber', 'Boston University', 176205.36000002007),
 ('Uber', 'Fenway', 162330.25000003376),
 ('Lyft', 'Financial District', 159784.21000001926),
 ('Lyft', 'Northeastern University', 157614.1400000097),
 ('Uber', 'North Station', 126590.34999999138),
 ('Uber', 'West End', 122684.05999999747),
 ('Uber', 'Beacon Hill', 116736.58000002701),
 ('Uber', 'Theatre District', 116131.59000003763),
 ('Uber', 'Back Bay', 115353.31999999755),
 ('Uber', 'South Station', 106621.34000001065)]

In [ ]:
%%sql
SELECT *
FROM cab_rides, weather
WHERE cab_rides.destination = weather.location
LIMIT 5;

 * sqlite://
Done.

[(0, 0.44, 'Lyft', 1544952607890, 'North Station', 'Haymarket Square', 5.0, 1.0, '424553bb-7174-41ea-aeb4-fe06d4f4b9d7', 'lyft_line', 'Shared', 7, 42.21, 'North Station', 1.0, 1012.16, 0.2069, 1545003901, 0.77, 11.37),
 (0, 0.44, 'Lyft', 1544952607890, 'North Station', 'Haymarket Square', 5.0, 1.0, '424553bb-7174-41ea-aeb4-fe06d4f4b9d7', 'lyft_line', 'Shared', 18, 41.95, 'North Station', 0.81, 991.63, None, 1543347920, 0.73, 10.87),
 (0, 0.44, 'Lyft', 1544952607890, 'North Station', 'Haymarket Square', 5.0, 1.0, '424553bb-7174-41ea-aeb4-fe06d4f4b9d7', 'lyft_line', 'Shared', 23, 43.92, 'North Station', 1.0, 1006.29, 0.0409, 1543277833, 0.9, 10.09),
 (0, 0.44, 'Lyft', 1544952607890, 'North Station', 'Haymarket Square', 5.0, 1.0, '424553bb-7174-41ea-aeb4-fe06d4f4b9d7', 'lyft_line', 'Shared', 43, 27.22, 'North Station', 0.15, 1033.4, None, 1544787901, 0.81, 3.01),
 (0, 0.44, 'Lyft', 1544952607890, 'North Station', 'Haymarket Square', 5.0, 1.0, '424553bb-7174-41ea-aeb4-fe06d4f4b9d7', 'lyft_line', 'Shared', 54, 45.47, 'North Station', 1.0, 1012.47, None, 1543253710, 0.86, 6.5)]